data/OpenFOAM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    front
    {
        type            empty;
        physicalType    patch;
        nFaces          41973;
        startFace       62652;
    }
    back
    {
        type            empty;
        physicalType    patch;
        nFaces          41973;
        startFace       104625;
    }
    exit
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       146598;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       146648;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       146698;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       146748;
    }
    aerofoil
    {
        type            wall;
        physicalType    patch;
        nFaces          415;
        startFace       146798;
    }
)

// ************************************************************************* //
