data/OpenFOAM/system/internalCloud
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields interpolated to a specified cloud of points.
\*---------------------------------------------------------------------------*/

fields (p U);
points
(
(-0.500000 -1.000000 0.500000)
(-0.492188 -1.000000 0.500000)
(-0.484375 -1.000000 0.500000)
(-0.476562 -1.000000 0.500000)
(-0.468750 -1.000000 0.500000)
(-0.460938 -1.000000 0.500000)
(-0.453125 -1.000000 0.500000)
(-0.445312 -1.000000 0.500000)
(-0.437500 -1.000000 0.500000)
(-0.429688 -1.000000 0.500000)
(-0.421875 -1.000000 0.500000)
(-0.414062 -1.000000 0.500000)
(-0.406250 -1.000000 0.500000)
(-0.398438 -1.000000 0.500000)
(-0.390625 -1.000000 0.500000)
(-0.382812 -1.000000 0.500000)
(-0.375000 -1.000000 0.500000)
(-0.367188 -1.000000 0.500000)
(-0.359375 -1.000000 0.500000)
(-0.351562 -1.000000 0.500000)
(-0.343750 -1.000000 0.500000)
(-0.335938 -1.000000 0.500000)
(-0.328125 -1.000000 0.500000)
(-0.320312 -1.000000 0.500000)
(-0.312500 -1.000000 0.500000)
(-0.304688 -1.000000 0.500000)
(-0.296875 -1.000000 0.500000)
(-0.289062 -1.000000 0.500000)
(-0.281250 -1.000000 0.500000)
(-0.273438 -1.000000 0.500000)
(-0.265625 -1.000000 0.500000)
(-0.257812 -1.000000 0.500000)
(-0.250000 -1.000000 0.500000)
(-0.242188 -1.000000 0.500000)
(-0.234375 -1.000000 0.500000)
(-0.226562 -1.000000 0.500000)
(-0.218750 -1.000000 0.500000)
(-0.210938 -1.000000 0.500000)
(-0.203125 -1.000000 0.500000)
(-0.195312 -1.000000 0.500000)
(-0.187500 -1.000000 0.500000)
(-0.179688 -1.000000 0.500000)
(-0.171875 -1.000000 0.500000)
(-0.164062 -1.000000 0.500000)
(-0.156250 -1.000000 0.500000)
(-0.148438 -1.000000 0.500000)
(-0.140625 -1.000000 0.500000)
(-0.132812 -1.000000 0.500000)
(-0.125000 -1.000000 0.500000)
(-0.117188 -1.000000 0.500000)
(-0.109375 -1.000000 0.500000)
(-0.101562 -1.000000 0.500000)
(-0.093750 -1.000000 0.500000)
(-0.085938 -1.000000 0.500000)
(-0.078125 -1.000000 0.500000)
(-0.070312 -1.000000 0.500000)
(-0.062500 -1.000000 0.500000)
(-0.054688 -1.000000 0.500000)
(-0.046875 -1.000000 0.500000)
(-0.039062 -1.000000 0.500000)
(-0.031250 -1.000000 0.500000)
(-0.023438 -1.000000 0.500000)
(-0.015625 -1.000000 0.500000)
(-0.007812 -1.000000 0.500000)
(0.000000 -1.000000 0.500000)
(0.007812 -1.000000 0.500000)
(0.015625 -1.000000 0.500000)
(0.023438 -1.000000 0.500000)
(0.031250 -1.000000 0.500000)
(0.039062 -1.000000 0.500000)
(0.046875 -1.000000 0.500000)
(0.054688 -1.000000 0.500000)
(0.062500 -1.000000 0.500000)
(0.070312 -1.000000 0.500000)
(0.078125 -1.000000 0.500000)
(0.085938 -1.000000 0.500000)
(0.093750 -1.000000 0.500000)
(0.101562 -1.000000 0.500000)
(0.109375 -1.000000 0.500000)
(0.117188 -1.000000 0.500000)
(0.125000 -1.000000 0.500000)
(0.132812 -1.000000 0.500000)
(0.140625 -1.000000 0.500000)
(0.148438 -1.000000 0.500000)
(0.156250 -1.000000 0.500000)
(0.164062 -1.000000 0.500000)
(0.171875 -1.000000 0.500000)
(0.179688 -1.000000 0.500000)
(0.187500 -1.000000 0.500000)
(0.195312 -1.000000 0.500000)
(0.203125 -1.000000 0.500000)
(0.210938 -1.000000 0.500000)
(0.218750 -1.000000 0.500000)
(0.226562 -1.000000 0.500000)
(0.234375 -1.000000 0.500000)
(0.242188 -1.000000 0.500000)
(0.250000 -1.000000 0.500000)
(0.257812 -1.000000 0.500000)
(0.265625 -1.000000 0.500000)
...
);

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
setFormat	raw;

executeControl  writeTime;
writeControl    writeTime;

sets
(
    cloud
    {
        type    cloud;
        axis    xyz;
        points  $points;
    }
);

// ************************************************************************* //
